InformationRegisters/СписаниеВремениНаЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СписаниеВремениНаЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзменения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначениеХарактеристик</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПричины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПричинПереносаСроков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазваниеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СписаниеВремениНаЗадачи/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Период = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КоличествоЧасов") Тогда
		НоваяЗаписьРегистра						= РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
		НоваяЗаписьРегистра.Период				= ТекущаяДата();
		НоваяЗаписьРегистра.Объект				= ЭтотОбъект.Отбор.Задача.Значение;
		НоваяЗаписьРегистра.НазваниеРеквизита	= "Удаление списания времени на задачи";
		НоваяЗаписьРегистра.Пользователь		= Пользователи.ТекущийПользователь();
		НоваяЗаписьРегистра.Значение			= Формат(ЭтотОбъект.ДополнительныеСвойства.КоличествоЧасов,"ДФ=ЧЧ:мм:сс");
		НоваяЗаписьРегистра.Записать();
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл 
		НоваяЗаписьРегистра						= РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
		НоваяЗаписьРегистра.Период				= ТекущаяДата();
		НоваяЗаписьРегистра.Объект				= ЗаписьРегистра.Задача;
		НоваяЗаписьРегистра.НазваниеРеквизита	= "Списание времени на задачи";
		НоваяЗаписьРегистра.Пользователь		= Пользователи.ТекущийПользователь();
		НоваяЗаписьРегистра.Значение			= Формат(ЗаписьРегистра.Время,"ДФ=ЧЧ:мм:сс");
		НоваяЗаписьРегистра.Записать();
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда //Удаление записи
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеВремениНаЗадачи.Время КАК Время
		|ИЗ
		|	РегистрСведений.СписаниеВремениНаЗадачи КАК СписаниеВремениНаЗадачи
		|ГДЕ
		|	СписаниеВремениНаЗадачи.Период = &Период
		|	И СписаниеВремениНаЗадачи.Задача = &Задача
		|	И СписаниеВремениНаЗадачи.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Задача", ЭтотОбъект.Отбор.Задача.Значение);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.Период.Значение);
		Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Отбор.Сотрудник.Значение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭтотОбъект.ДополнительныеСвойства.Вставить("КоличествоЧасов", ВыборкаДетальныеЗаписи.Время);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
